# AddSubFolder Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExternalResourceBrowserData..::..AddSubFolder Method
ExternalResourceBrowserData Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddSubFolder(String) | Adds a subfolder to the folder path with the given name. |
| AddSubFolder(String, String) | Adds a subfolder to the folder path with the given name and icon type. |

# See Also
ExternalResourceBrowserData Class
ExternalResourceBrowserData Members
Autodesk.Revit.DB Namespace